#  Дано рядок. (зробити зрізи)
text = "Съешь ещё этих мягких французских булок, да выпей чаю!"
print(text)
# - Спершу виведіть третій символ цього рядка.
print(text[2])
# - У другому рядку виведіть передостанній символ цього рядка.
print(text[-2])
# - У третьому рядку виведіть перші п'ять символів цього рядка.
print(text[:5])
# - У четвертому рядку виведіть весь рядок, крім двох останніх символів.
print(text[:-2])
# - У п'ятому рядку виведіть усі символи з парними індексами (вважаючи, що індексація починається з 0, тому символи виводяться з першого).
print(text[::2])
# - У шостому рядку виведіть усі символи з непарними індексами, тобто, починаючи з другого символу рядка.
print(text[1::2])
# - У сьомому рядку виведіть усі символи у зворотному порядку.
print(text[::-1])
# - У восьмому рядку виведіть усі символи рядка через один у зворотному порядку, починаючи з останнього.
print(text[::-2])
# - У дев'ятому рядку виведіть довжину цього рядка.
print(len(text))