# Завдання 1

# Напишіть функцію, яка обчислює добуток елементів списку цілих. Список передається як параметр. Отриманий результат повертається із функції.
'''
Создаем функцию, которая имеет изначальный результат 1 (так как умножение) и перебирает каждое число из списка,
умножная результат на это число (result = result * i). После перебора возвращает конечный результат в функцию.
Вводим числа через инпут через пробел и создаем список из строки через сплит. После переводим каждый элемент списка
из строки в целое число перебирая элементы в списке. В конце прописываем саму функцию и вывод результата.
'''
def list_mult(mult_list):
    result = 1
    for i in mult_list:
        result *= i
    return result

nums = input("Через пробел введите числа, которые хотите перемножить: ")
nums_list = nums.split(' ')

nums_list = [int(num) for num in nums_list]

mult_res = list_mult(nums_list)
print(mult_res)

# Завдання 2

# Напишіть функцію для знаходження мінімуму у списку цілих. Список передається як параметр. Отриманий результат повертається із функції.

# Завдання 3

# Напишіть функцію, яка визначає кількість простих чисел у списку цілих. Список передається як параметр. Отриманий результат повертається із функції.

# Завдання 4

# Напишіть функцію, яка видаляє зі списку ціле задане число. З функції потрібно повернути кількість видаленних елементів.

# Завдання 5

# Напишіть функцію, яка отримує два списки як параметр і повертає список, що містить елементи обох списків.

# Завдання 6

# Напишіть функцію, яка обчислює ступінь кожного елемента списку цілих. Значення для ступеня передається як параметр, список також передається як параметр. Функція повертає новий список, який містить отримані результати.